app/controllers/articles_controller.rb

  def index
    json_response Article.all.to_json
---
SELECT "articles".* FROM "articles" WHERE (published_at >= '2018-03-12 20:12:40') AND (published_at <= '2018-03-12 13:14:39')